import type { Meta, StoryObj } from '@storybook/react';

import { ColumnText } from '.';

export default {
  component: ColumnText,
} satisfies Meta<typeof ColumnText>;

type Story = StoryObj<typeof ColumnText>;

export const Primary: Story = {
  args: {
    children: `Містер і місіс Дурслі, що жили в будинку номер чотири на вуличці Прівіт-драйв, пишалися тим, що були, слава Богу, абсолютно нормальними. Кого-кого, але тільки не їх можна було б запідозрити, що вони пов'язані з таємницями чи дивами, бо такими дурницями вони не цікавилися. Містер Дурслі керував фірмою "Ґраннінґс", яка виготовляла свердла. То був такий дебелий чолов'яга, що, здається, й шиї не мав, зате його обличчя прикрашали пишні вуса. Натомість місіс Дурслі була худорлява, білява, а її шия була майже вдвічі довша, ніж у звичайних людей, і це ставало їй у великій пригоді: надто вже вона полюбляла зазирати через паркан, підглядаючи за сусідами. Подружжя Дурслі мало синочка Дадлі, що був, на думку батьків, найкращим у світі.`,
  },
};
